"%lu day left on trial" = "Koekäyttöä jäljellä %lu päivä";
"%lu days left on trial" = "Koekäyttöä jäljellä %lu päivää";
"Apply" = "Käytä";
"Back" = "Takaisin";
"Buy Later" = "Osta myöhemmin";
"Buy Now" = "Osta nyt";
"Cancel" = "Kumoa";
"Close" = "Sulje";
"Continue" = "Jatka";
"Did you <a href=\"%@\">lose your licence?</a>" = "Oletko <a href=\"%@\">kadottanut lisenssisi?</a>";
"Email License to:" = "Lähetä lisenssi osoitteeseen:";
"Email address is blank!" = "Sähköpostiosoite on tyhjä!";
"Enter your serial number below to unlock Path Finder" = "Syötä sarjanumerosi alle avataksesi Path Finderin täysversion";
"Free Trial" = "Ilmainen koekäyttö";
"Free trial has expired" = "Ilmainen koekäyttö on päättynyt";
"If you need help, email us at help@cocoatech.com" = "Jos tarvitset apua, lähetä sähköpostia osoitteeseen help@cocoatech.com";
"If you own Path Finder 6, enter your name and license key to be eligable for the upgrade discount. Continue to the next step if you are a first time buyer." = "Jos omistat Path Finder 6:n, syötä nimesi ja lisenssikoodisi alle hyötyäksesi päivitysalennuksesta. Jatka seuraavaan osioon jos ostat tuotetta ensi kertaa.";
"Licensed for %ld user" = "Lisensoitu %ld käyttäjälle";
"Licensed for %ld users" = "Lisensoitu %ld käyttäjälle";
"Not licensed" = "Ei lisenssiä";
"Path Finder 6 License" = "Path Finder 6 -lisenssi";
"Path Finder has been successfully registered. Save your registration information in a safe place." = "Path Finder on onnistuneesti rekisteröity. Säilö rekisteröintitietosi turvallisessa paikassa.";
"Processing..." = "Käsitellään...";
"Purchase" = "Osta";
"Purchase Path Finder. It's Fast, Simple and Secure." = "Osta Path Finder. Se on helppoa, yksinkertaista ja turvallista.";
"Purchase successful. Thank you!" = "Ostotapahtuma onnistui. Kiitos!";
"Purchase unsuccessful. Let us know what happened. Email us at help@cocoatech.com" = "Ostotapahtuma epäonnistui. Kerro meille, mitä tapahtui. Lähetä sähköpostia osoitteeseen help@cocoatech.com";
"Quit" = "Lopeta";
"Registration" = "Rekisteröinti";
"Registration Code Invalid" = "Virheellinen rekisteröintikoodi";
"Registration Successful" = "Rekisteröinti onnistui";
"Request Sent" = "Pyyntö lähetetty";
"Send" = "Lähetä";
"Thank you!" = "Kiitos!";
"The Path Finder 6 license key you entered is not valid." = "Syötetty Path Finder 6 -lisenssiavain ei ole kelvollinen.";
"The trial period has expired." = "Ilmainen koekäyttö on päättynyt.";
"There was a problem with the name or license code you entered. Copy and paste the text from the order email and try again. If you still have problems, visit our lost license code page." = "Syötetyn nimen tai lisenssiavaimen kanssa ilmeni ongelma. Kopioi ja sijoita teksti tilausvahvistussähköpostistasi ja yritä uudelleen. Jos ongelmat jatkuvat, käy Kadonnut lisenssi -sivuillamme.";
"Unlock" = "Avaa täysversio";
"Upgrading from version 6?" = "Päivitätkö versiosta 6?";
"Valid for Upgrade!" = "Soveltuu päivitykseen!";
"Wait %u" = "Odota %u";
"You entered the correct name and license code. Thank you for registering Path Finder." = "Syötit oikeaksi vahvistetun nimen ja lisenssiavaimen. Kiitos, että rekisteröit Path Finderin.";
"You will receive your unique serial number instantly." = "Yksilöllinen sarjanumerosi toimitetaan välittömästi.";
"You're all done. Close this window to continue launching Path Finder. Print this page to make a hard copy of your license code in case you need to install on a new computer in the future." = "Valmis! Sulje tämä ikkuna käynnistääksesi Path Finderin. Tulosta tämä sivu taltioksi lisenssikoodistasi siltä varalta, että joudut asentamaan sovelluksen uudelleen tulevaisuudessa.";
"Your 30 day trial has expired. Please purchase Path Finder." = "30 päivän ilmainen koekäyttö on päättynyt. Ole hyvä ja osta Path Finder.";
"Your serial number is in your confirmation email." = "Sarjanumerosi on tilausvahvistussähköpostissa.";

/* ==== UNLOCALIZED ==== */

"OK" = "OK";
